In [0]:
from pandas import DataFrame

In [0]:
dframe = DataFrame({'key1':['A'] * 2 + ['B'] * 3, 'key2': [2,2,2,3,3]})

In [3]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [4]:
dframe.duplicated() # 行が重複しているかを確認

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [5]:
dframe.drop_duplicates() # 重複している行を削除する

  key1  key2
0    A     2
2    B     2
3    B     3

In [6]:
dframe.drop_duplicates(['key1']) # 重複をチェックする列を指定することができる

  key1  key2
0    A     2
2    B     2

In [7]:
dframe.drop_duplicates(['key2'])

  key1  key2
0    A     2
3    B     3

In [8]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [10]:
dframe.drop_duplicates(['key1'], keep='last')  # 重複している最後の行を残す

  key1  key2
1    A     2
4    B     3

In [11]:
dframe.drop_duplicates(['key1'], keep='first') # 重複している最初の行を残す

  key1  key2
0    A     2
2    B     2